{
    "mainPage": {
        "clansCard": {
            "title": "Clans",
            "description": "There are a lot of clans within NarutoVerse"
        },
        "charactersCard": {
            "title": "Characters",
            "description": "Get information about anyone within NarutoVerse"
        },
        "button": "Let's go"
    },
    "header": "Naruto Wiki",
    "footer": {
        "about": "About this project",
        "author": "About the author",
        "copyRight": "CopyRight"
    },
    "loader": "Loading...",
    "clansPage": {
        "column1": "Symbol",
        "column2": "Name",
        "column3": "Info",
        "link": "Check detailed information for",
        "input": "Search by name"
    },
    "charactersPage": {
        "detail": "Get info",
        "input": "Search by name or lastname",
        "buttonModal": "Got It",
        "orderByName": "Order by Name",
        "orderByTop": "Most populars",
        "search": "Search",
        "fanPage": "Go to fan page",
        "notFound": "Coincidences were not found"
    },
    "modalError": {
        "title": "¡Error!",
        "description": "We are sorry. An unexpected error is happened. Please try again or call 3214876038 for more information."
    },
    "aboutMe": {
        "mainInfo": {
            "birthDate": "Date of birth",
            "birthDateValue": "October 26th of 1998. (24 years old)",
            "phoneNumber": "Phone number",
            "linkedIn": "LinkedIn profile"
        },
        "profile": {
            "title": "Profile",
            "first": "Electronic engineer with Colombian professional certificate, advanced English skills, and knowledge and interests on software development and IT.",
            "second": "With professional experience on full stack development, using techonologies such as Angular, Bootstrap, NodeJS, SQL, NoSQL, AWS and Azure; quality assurance and automation testing using Selenium and Java, and also academic and research experience on other technologies such as React, Vue, Express, Sails, Python and JavaScript.",
            "third": "With aptitudes of self-learning, adaptability to change and problem solving.",
            "fourth": "Eager to learn and experience new things and situations that contribute to the professional, academic, cultural and personal growing."
        },
        "languages": {
            "title": "Languages",
            "english": "English",
            "englishLevel": "C1",
            "spanish": "Spanish",
            "spanishLevel": "Native"
        },
        "experience": {
            "title": "Professional Experience",
            "accenture": {
                "dateInit": "February 2021",
                "dateEnd": "Currently",
                "jobTitle": "Software developer at Accenture",
                "description": "Full time software developer. Activities and achievements reached",
                "task1": "Front-end development of web applications applying a micro front-end architecture using Angular. ",
                "task2": "Microservices development using NodeJS and AWS Lambdas.",
                "task3": "CI/CD.",
                "task4": "Unit testing (Jasmine/Karma - Jest",
                "task5": "Development teams leadership. "
            },
            "teleperformance": {
                "dateInit": "July 2020",
                "dateEnd": "January 2021",
                "jobTitle": "Bilingual Agent at Teleperformance",
                "description": "Activities related to customer service as a bilingual agent."
            },
            "ibm": {
                "dateInit": "July 2019",
                "dateEnd": "December 2019",
                "jobTitle": "Intern at IBM",
                "description": "Intern at Global Business Services (GBS). Achievements reached",
                "task1": "Software testing (test cases statement and execution -manual and automated-) of web and mobile applications.",
                "task2": "Test automation with Selenium, Cucumber and SoapUI. "
            }
        },
        "education": {
            "title": "Education",
            "institution": "Institution",
            "santoTomas": {
                "programTitle": "Bachelor’s degree in electronic engineering.",
                "institution": "Santo Tomás Univerisity. Colombia.",
                "description": "Three times best grade point average within all electronic engineering students."
            },
            "uabc": {
                "programTitle": "Bachelor’s degree in electronic engineering.",
                "institution": "Universidad Autónoma de Baja California. México.",
                "description": "Academic Exchange, fifth semester. Broad scholarship."
            }
        },
        "complementaryEducation": {
            "title": "Complementary Education.",
            "aws": {
                "date": "February 2023",
                "title": "AWS Cloud Practitioner",
                "description": "Course for the certification “AWS Cloud Practitioner”."
            },
            "devops": {
                "date": "April 2022",
                "title": "Azure DevOps",
                "description": "Course for the exam “AZ-400 - Designing and Implementing Microsoft DevOps Solutions” exam by Microsoft. Which focuses on Continuous Integration, Continuous Delivery, Continuous Deployment, Source Control and Monitoring of applications."
            },
            "nextU": {
                "date": "January - October 2021",
                "title": "Software Development Certificate",
                "description": "It consists on the modules: “Python”, “Front End Technologies”, “Back End Technologies”, “Data bases”, “Git” and “JavaScript Frameworks”. NextU."
            },
            "misionTIC": {
                "date": "September - December 2020",
                "title": "Misión TIC 2022",
                "description": "600 hours course about local and web applications with Python, Java, JavaScript, HTML, CSS and Flask. Ministerium of Information and Communication Technologies of Colombia."
            },
            "watson": {
                "date": "August 2019",
                "title": "Watson Assistant Foundations",
                "description": "IBM."
            },
            "sakura": {
                "date": "December 2018",
                "title": "SAKURA Exchange Program in Science",
                "description": "Broad scholarship for the “Robotics in Non-Verbal Communication Environments” course. Saitama University, Japan."
            }
        },
        "techSkills": {
            "title": "Technical Skills.",
            "technologies": {
                "title": "Software/Technologies/Frameworks",
                "description": "Angular+, React, Vue, Bootstrap, AJAX, JQuery, NodeJS, Serverless, AWS Lambda, Sails, Express, Flask, MySQL, PostgreSQL, MongoDB, CouchDB, GIT, Selenium, Visual Studio, VSCode, LabView, Tia Portal, MATLAB, Simulink, Proteus, ORCAD, Multisim, PSpice, Microsoft Office."
            },
            "programmingLanguages": {
                "title": "Programming Languages",
                "description": "Java, JavaScript, TypeScript, HTML, CSS, Python, SQL, NoSQL, C++, Ladder."
            },
            "platforms": {
                "title": "Methodologies/Platforms",
                "description": "Scrum, Agile, Microsoft Azure (as following-up system for projects and applications CI/CD platform), Jira (as following-up system for projects)."
            },
            "devices": {
                "title": "Devices",
                "description": "PLC, FPGA, PIC, Raspberry Pi, Arduino."
            }
        }
    },
    "aboutProject": {
        "title": "About this project",
        "description": "This is an Angular V.16 project, which was developed with the next basic tools for this Framework",
        "components": "Components",
        "componentsDesc": "They are the base for each Angular project, they can be built from other smaller components, and some examples in this projects are the Alerts, the Loader, the Footer, and more. The main idea about components, is that you can re-use them inside other modules of your application.",
        "services": "Services",
        "servicesDesc": "They are classes that you can instantiate in other components of your project, to share data between them, or just to declare functions that are going to be common. In this project, there is only one service, and inside of it, the methods to call APIs and get Naruto info are declared.",
        "routing": "Routing",
        "routingDesc": "As a SPA (Single Page Application), the way to change between screens is routing. There are five routes in these project: 'main-page', 'clans', 'characters', 'about' y 'author', each one of them takes you to a speciffic page.",
        "modules": "Modules",
        "modulesDesc": "Modules are used to declare components or dependencies that are going to be used in speciffic screens",
        "lazyLoading": "Lazy Loading",
        "lazyLoadingDesc": "It is a strategy to download only the modules that the user requires. This way, the application will charge faster.",
        "forms": "Reactive Forms",
        "formsDesc": "A very helpfull way to interact with forms components. In the application, reactive forms are implemented to detect changes in Input components within Clans and Characters pages.",
        "api": "HttpModule",
        "apiDesc": "It is the dependency proposed by Angular to call APIs. An instance of HttpModule is used in the service to bring information from the backend.",
        "interceptors": "Intercerptors",
        "interceptorsDesc": "As its name says, they allow you to intercept Http requests before they connect with the server, to perform certain task. In the project, there is an interceptor that shows the loader when the request just started, and hides it when it has finished.",
        "otherFeatures": "Also, other tools to make the front end development easier were used",
        "bootstrap": "Bootstrap",
        "bootstrapDesc": "It is a library which adds styles to HTML tags when speciffic classes are defined. Within the project, bootstrap is mostly used for Responsive behavior, it means, that elements are placed correctly on screen, whatever its size is.",
        "css": "CSS preprocessors",
        "cssDesc": "Style Sheets in this project are not a .css file. SASS is used to have a better manage of styles, by defining variables and importing them in different components.",
        "internationalization": "Internationalization",
        "internationalizationDesc": "It allows to change the page language. Click the button on the top right corner of the page and find out.",
        "unitTesting": "Unit Testing",
        "unitTestingDesc": "Very important for any project development. It assures you that your components will do what they are supposed to do. And in case of improvements or new features, they assure that the changes have not impacted in the bussiness logic.",
        "thanks": "Thanks a lot for taking the time to check this project out. I have developed it in my free time with so much passion, for Naruto and of course Angular."
    }
}